In [2]:
#DemoPandas_연습.ipynb
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

#시리즈 객체 생성
multi = Series([100,200,300,400,500])
multi2 = Series(np.arange(100,600,100))
print(multi)
print(type(multi))
print(multi2)
print(type(multi2))

0    100
1    200
2    300
3    400
4    500
dtype: int64
<class 'pandas.core.series.Series'>
0    100
1    200
2    300
3    400
4    500
dtype: int32
<class 'pandas.core.series.Series'>

In [9]:
multi2 = Series(np.arange(100,600,100),
                index=np.arange(0,5))
print(multi2)

0    100
1    200
2    300
3    400
4    500
dtype: int32

In [10]:
data = np.arange(1000,4000,1000)
s = Series(data)
s.index = ["메로나", "구구콘", "브라보"]
s["구구콘"]

2000

In [13]:
data = np.arange(1000,4000,1000)
index = ["메로나", "구구콘", "브라보"]
s = Series(index, data)
s

1000    메로나
2000    구구콘
3000    브라보
dtype: object

In [15]:
data = np.arange(1000,4000,1000)
index = ["메로나", "구구콘", "브라보"]
s = Series(data=data, index=index)
s

메로나    1000
구구콘    2000
브라보    3000
dtype: int32

In [16]:
#리인덱스
s2 = s.reindex(["메로나","비비빅","구구콘"])
s2

메로나    1000.0
비비빅       NaN
구구콘    2000.0
dtype: float64

In [19]:
#주식 데이터 딕셔너리 선언
data = {"외국인":[1,2,3,4,5,6],
        "기관": [10,20,30,40,50,60],
        "sratio":[100,200,300,400,500,600],
        "sprice":[1,2,3,4,5,6],
        "개인": [10,20,30,40,50,60]
}
data

#데이터 프레임으로 전환
frame = DataFrame(data)
frame

   외국인  기관  sratio  sprice  개인
0    1  10     100       1  10
1    2  20     200       2  20
2    3  30     300       3  30
3    4  40     400       4  40
4    5  50     500       5  50
5    6  60     600       6  60

In [23]:
frame2 = DataFrame(data, 
                   columns=["외국인","sratio","기관","sprice", "개인"],
                   index =["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05","2023-01-06"])
print(frame2)
print(frame2["외국인"])
print(frame2.loc["2023-01-03"])
frame3 = frame2.T
print(frame3)

            외국인  sratio  기관  sprice  개인
2023-01-01    1     100  10       1  10
2023-01-02    2     200  20       2  20
2023-01-03    3     300  30       3  30
2023-01-04    4     400  40       4  40
2023-01-05    5     500  50       5  50
2023-01-06    6     600  60       6  60
2023-01-01    1
2023-01-02    2
2023-01-03    3
2023-01-04    4
2023-01-05    5
2023-01-06    6
Name: 외국인, dtype: int64
외국인         3
sratio    300
기관         30
sprice      3
개인         30
Name: 2023-01-03, dtype: int64
        2023-01-01  2023-01-02  2023-01-03  2023-01-04  2023-01-05  2023-01-06
외국인              1           2           3           4           5           6
sratio         100         200         300         400         500         600
기관              10          20          30          40          50          60
sprice           1           2           3           4           5           6
개인              10          20          30          40          50          60

In [24]:
frame2

            외국인  sratio  기관  sprice  개인
2023-01-01    1     100  10       1  10
2023-01-02    2     200  20       2  20
2023-01-03    3     300  30       3  30
2023-01-04    4     400  40       4  40
2023-01-05    5     500  50       5  50
2023-01-06    6     600  60       6  60

In [25]:
frame3

        2023-01-01  2023-01-02  2023-01-03  2023-01-04  2023-01-05  2023-01-06
외국인              1           2           3           4           5           6
sratio         100         200         300         400         500         600
기관              10          20          30          40          50          60
sprice           1           2           3           4           5           6
개인              10          20          30          40          50          60

In [26]:
#하나의 행을 슬라이싱
frame2.loc["2023-01-03"]

외국인         3
sratio    300
기관         30
sprice      3
개인         30
Name: 2023-01-03, dtype: int64

In [29]:
data = {
    "종목코드" : ["037730", "036740", "024650"],
    "종목명":["3R","3SOFT","ACTS"],
    "현재가":["3000","4000","5000"]
}

df = DataFrame(data)
df

     종목코드    종목명   현재가
0  037730     3R  3000
1  036740  3SOFT  4000
2  024650   ACTS  5000

In [32]:
data = [
    ["037730", "3R", "3000"],
    ["036740","3SOFT","4000"],
    ["024650","ACTS","5000"]
]
#컬럼명
col = ["종목코드","종목명","현재가"]
df = DataFrame(data=data, columns= col)
df

     종목코드    종목명   현재가
0  037730     3R  3000
1  036740  3SOFT  4000
2  024650   ACTS  5000

In [33]:
data = [
    ["037730", "3R", "3000"],
    ["036740","3SOFT","4000"],
    ["024650","ACTS","5000"]
]
#컬럼명
col = ["종목코드","종목명","현재가"]
df = DataFrame(data=data, columns= col)
#색인 지정
df = df.set_index("종목코드")
df

          종목명   현재가
종목코드
037730     3R  3000
036740  3SOFT  4000
024650   ACTS  5000

In [34]:
df.loc["036740"]

종목명    3SOFT
현재가     4000
Name: 036740, dtype: object